In [32]:
import pandas as pd
movies = pd.read_csv("C:/Users/rain/Desktop/Movies.csv")
movies.head()

      Name  Movie 1  Movie 2  Movie 3  Movie 4  Movie 5  Movie 6
0     Mike        1        4        4      NaN        5        3
1   Victor        2        2        3      NaN        5        5
2      Bob        1        1        1      NaN        4        3
3  Vincent        3        2        1      NaN        1        5
4    Lemon        3        4        4      NaN        4        1

In [69]:
userratingaverage = movies.mean(axis=1)
print(userratingaverage)

0    3.4
1    3.4
2    2.0
3    2.4
4    3.2
dtype: float64

In [70]:
movie1 = movies.mean(axis=0)
print(movie1)

Movie 1    2.0
Movie 2    2.6
Movie 3    2.6
Movie 4    NaN
Movie 5    3.8
Movie 6    3.4
dtype: float64

In [24]:
movies = pd.read_csv("C:/Users/rain/Desktop/Movies.csv")
movies = movies.drop('Name', 1)
movies

   Movie 1  Movie 2  Movie 3  Movie 4  Movie 5  Movie 6
0        1        4        4      NaN        5        3
1        2        2        3      NaN        5        5
2        1        1        1      NaN        4        3
3        3        2        1      NaN        1        5
4        3        4        4      NaN        4        1

In [10]:
#Normalization with maximum absolute scaling
userratingaverage = movies.mean(axis=1)
userratingaverage = userratingaverage/userratingaverage.abs().max()
userratingaverage

0    1.000000
1    1.000000
2    0.533333
3    0.666667
4    0.933333
dtype: float64

In [12]:
movie1 = movies.mean(axis=0)
movie1 = movie1/movie1.abs().max()
movie1

Movie 1    0.000000
Movie 2    0.684211
Movie 3    0.684211
Movie 4         NaN
Movie 5    1.000000
Movie 6    0.894737
dtype: float64

In [6]:
#The benefit of normalization is to bring obversations closer to eachother in terms of values, its easier to read.
#The problem is that it doesn't show accurate measurements.

In [13]:
#Standardization with the z-score method
movies_copy = movies.copy()
column = 'Movie 1'
movies_copy[column] = (movies_copy[column] - movies_copy[column].mean()) / movies_copy[column].std()
movies

   Movie 1  Movie 2  Movie 3  Movie 4  Movie 5  Movie 6
0     -1.0        4        4      NaN        5        3
1      0.0        2        3      NaN        5        5
2     -1.0        1        1      NaN        4        3
3      1.0        2        1      NaN        1        5
4      1.0        4        4      NaN        4        1

In [35]:
movies = pd.read_csv("C:/Users/rain/Desktop/Movies.csv",index_col ="Name")
rows = movies.loc["Mike"]

for column in rows:
    rows = (rows - rows.mean()) / rows.std()
rows

Movie 1   -1.582513
Movie 2    0.395628
Movie 3    0.395628
Movie 4         NaN
Movie 5    1.055009
Movie 6   -0.263752
Name: Mike, dtype: float64